surfaceWater/runCases/RANS/1mmOG/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            empty;
    }
    left
    {
        type            cyclicAMI;
//        value           uniform (0 0 0);
    }
    top
    {
        type            zeroGradient;
    }
    right
    {
        type            cyclicAMI;
//        value           uniform (0 0 0);
    }
    bottom
    {
        type            noSlip;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
